<?php
/**
 * User: liyubing
 * Date: 2018/4/21
 * 题库文件，以数组的形式存储考题
 */
return [
    'title'   => '编译原理',       //试题标题
    'timeout' => 1200,                      //答题时间（单位：s）
    'data'    =>[                           //试题数组
        'judge' =>[                        //判断题
            'name' =>'判断题',             //题型名称
            'score'=>'2',                  //分数
            'data' =>[                      //试题内容
				1 => [
                    'question' => '用高级语言书写的源程序都必须通过编译，产生目标代码后才能投入运行。(       )',
                    'answer' => 'F'
                ], 2=> [
                    'question' => '解释程序和编译程序的区别在于是否生成目标程序代码。(        ) ',
                    'answer' => 'T'
                ], 3=> [
                    'question' => '一个有限状态自动机中，有且仅有一个唯一的终态。(        )',
                    'answer' => 'F'
                ], 4=> [
                    'question' => '确定的自动机以及不确定的自动机都能正确地识别正规集。（      ）',
                    'answer' => 'T'
                ], 5=> [
                    'question' => '非确定有限自动机的状态转换函数是单值函数。(         )',
                    'answer' => 'F'
                ], 6=> [
                    'question' => '文法分为四种类型，即 0 型、1 型、2 型、3 型。其中 2 型文法是正规文法。（      ）',
                    'answer' => 'F'
                ], 7=> [
                    'question' => '计算机高级语言翻译成低级语言只有解释一种方式。（      ）',
                    'answer' => 'F'
                ], 8=> [
                    'question' => '在编译中进行语法检查的目的是为了发现程序中所有错误。（      ）',
                    'answer' => 'F'
                ], 9=> [
                    'question' => '每个文法都能改写为 LL(1) 文法。（      ）',
                    'answer' => 'T'
                ], 10=> [
                    'question' => '产生式是用于定义词法成分 的一种书写规则。（      ）',
                    'answer' => 'F'
                ], 11=> [
                    'question' => '对于给定的非确定有限自动机一定存在一个确定有限自动机与其等价。（      ）',
                    'answer' => 'T'
                ], 12=> [
                    'question' => '如果一个文法存在某个句子对应两棵不同的语法树，则文法是二义性的。（      ）',
                    'answer' => 'T'
                ], 13=> [
                    'question' => '3型文法一定是2型文法。（      ）',
                    'answer' => 'T'
                ], 14=> [
                    'question' => '一个句型的直接短语是唯一的。（      ）',
                    'answer' => 'F'
                ], 15=> [
                    'question' => '编译过程中，语法分析器的任务是分析单词是怎样构成的。（      ）',
                    'answer' => 'F'
                ], 16=> [
                    'question' => '如果给定的一个正规表达式R，一定存在一个等价的NFA M ，两者识别的语言是等价的。（      ）',
                    'answer' => 'T'
                ], 17=> [
                    'question' => '确定的自顶向下的语法分析，不可以包含公共左因子，是因为公共左因子会导致推导死循环。（      ）',
                    'answer' => 'F'
                ]
            ]
        ],
        'choice' =>[                        //单选题
            'name' => '单选题',
            'score' => '3',
            'data' =>[
                1 => [
                    'question' => '编译程序是对__________。',
                    'option' => [
                        '汇编程序的翻译','高级语言的解释执行','机器语言的执行','高级语言的翻译'
                    ],
                    'answer' => 'D'
                ], 2=> [
                    'question' => '编译程序分成若干个"遍"是为了_________。',
                    'option' => [
                        '使程序的结构更加清晰','提高程序的执行效率','利用有限的内存，提高机器的效率','利用有限的内存，降低机器的效率'
                    ],
                    'answer' => 'A'
                ], 3=> [
                    'question' => '_________不是编译程序的组成部分。',
                    'option' => [
                        '词法分析程序','语法分析程序','语义分析程序','设备管理程序'
                    ],
                    'answer' => 'D'
                ], 4=> [
                    'question' => '_________不可能是目标代码。',
                    'option' => [
                        '汇编指令代码','中间代码','可重定位代码','绝对指令代码'
                    ],
                    'answer' => 'B'
                ], 5=> [
                    'question' => '编译的各阶段工作都涉及_________。',
                    'option' => [
                        '词法分析','表格管理','语法分析','语义分析'
                    ],
                    'answer' => 'A'
                ], 6=> [
                    'question' => '一个编译程序中，不仅包含词法分析，_________，中间代码生成，代码优化， 目标代码生成等五个部分。',
                    'option' => [
                        '语法分析','文法分析','语言分析','解释分析'
                    ],
                    'answer' => 'A'
                ], 7=> [
                    'question' => '正规式M1和M2等价是指_________。',
                    'option' => [
                        'M1和M2的状态数相等',' M1和M2的有向弧条数相等','M1和M2所识别的语言值相等','M1和M2状态数和有向弧条数相等'
                    ],
                    'answer' => 'C'
                ], 8=> [
                    'question' => '词法分析的任务是_________。',
                    'option' => [
                        '识别单词','分析句子的含义','识别句子','生成目标代码'
                    ],
                    'answer' => 'A'
                ], 9=> [
                    'question' => '词法分析器的输出结果是_________。',
                    'option' => [
                        '单词的种别编码','单词在符号表中的位置','单词的种别编码和自身值','单词自身值'
                    ],
                    'answer' => 'C'
                ], 10=> [
                    'question' => '词法分析所依据的是_________。',
                    'option' => [
                        '语义规则','构词规则','语法规则','等价变换规则'
                    ],
                    'answer' => 'B'
                ], 11=> [
                    'question' => 'DFA适用于_________。',
                    'option' => [
                        '定理证明','语法分析','词法分析','语义加工'
                    ],
                    'answer' => 'C'
                ], 12=> [
                    'question' => '与(a|b)*(a|b)等价的正规式是_________。',
                    'option' => [
                        ' (a|b) (a|b)*','a*|b*','(a|b)* (a|b)*',' (a|b)*'
                    ],
                    'answer' => 'A'
                ], 13=> [
                    'question' => '如果文法G是无二义的，则下面_________成立。',
                    'option' => [
                        '文法的一个句子对应两棵不同的语法树','文法中的某个句子有两个不同的最左推导','文法中的某个句子有两个不同的最右推导','对于文法中的任意一个句子，它的最左或最右推导对应的语法树相同。'
                    ],
                    'answer' => 'D'
                ], 14=> [
                    'question' => '由文法的开始符号经0步或多步推导产生的文法符号序列是_________。',
                    'option' => [
                        '短语','句柄','句型','句子'
                    ],
                    'answer' => 'C'
                ], 15=> [
                    'question' => '若一个文法是递归的，则它产生语言的句子个数_________。',
                    'option' => [
                        '必定是无穷的','根据情况而定','是有穷个','有穷个，但是个数很大'
                    ],
                    'answer' => 'A'
                ], 16=> [
                    'question' => '文法G[A]:A→0A0|1所识别的语言是_________。',
                    'option' => [
                        '010','(010)*','0^n10^n(n>=0)','0*10*'
                    ],
                    'answer' => 'C'
                ], 17=> [
                    'question' => '____________型文法也称为正规文法。',
                    'option' => [
                        '0','1','2','3'
                    ],
                    'answer' => 'D'
                ], 18=> [
                    'question' => '下面对语法树错误的描述是_______。',
                    'option' => [
                        '根结点用文法G(S)的开始符号S标记','每个结点用G(S)的一个终结符或非终结符标记','如果某结点标记为ε,则它比为叶结点','内部结点可以是终结点符'
                    ],
                    'answer' => 'D'
                ], 19=> [
                    'question' => '文法 G[E] ：<br/>
E →T∣E + T<br/>
T →F∣T * F<br/>
F →a∣( E ) <br/>
该文法句型 E ＋ F * (E ＋ T) 的直接短语短语是下列符号串中的_______。<br/>
① （ E ＋ T ）  ②E ＋ T      ③F     ④ F * (E ＋ T)
',
                    'option' => [
                        '① 和 ③','② 和 ③','③ 和 ④','③'
                    ],
                    'answer' => 'A'
                ], 20=> [
                    'question' => '若一个文法是左递归的，则它所产生的语言的句子_______。',
                    'option' => [
                        '是无穷多个','是有穷多个','是可枚举的','个数是常量'
                    ],
                    'answer' => 'A'
                ], 21=> [
                    'question' => '_______是两类程序语言处理程序。',
                    'option' => [
                        '高级语言程序和低级语言程序','解释程序和编译程序','编译程序和操作系统','系统程序和应用程序'
                    ],
                    'answer' => 'B'
                ], 22=> [
                    'question' => '编译程序绝大多数时间花在_______ 上。',
                    'option' => [
                        '出错处理','词法分析','目标代码生成','表格管理'
                    ],
                    'answer' => 'D'
                ], 23=> [
                    'question' => '文法 G[N]= ( {b} ，{N ，B} ，N ，{N→b│bB ，B→bN} )，该文法所描述
的语言是_______。
',
                    'option' => [
                        'L(G[N])={b^i│i≥0}','()L(G[N])={b^(2i)│i≥0} ','()L(G[N])={b^(2i+1)│i≥0} ','以上都不对'
                    ],
                    'answer' => 'C'
                ], 24=> [
                    'question' => '在语法分析处理中， FIRST 集合、 FOLLOW 集合均是_____。',
                    'option' => [
                        '非终极符集','终极符集','字母表','状态集'
                    ],
                    'answer' => 'B'
                ], 25=> [
                    'question' => '语言是_______。',
                    'option' => [
                        '句子的集合','产生式的集合','符号串的集合','句型的集合'
                    ],
                    'answer' => 'A'
                ], 26=> [
                    'question' => '已知文法为：<br/>
A → aAd | aAb |  ε<br/>
该文法属于_____________。
',
                    'option' => [
                        '0型文法','1型文法','2型文法','3型文法'
                    ],
                    'answer' => 'C'
                ], 27=> [
                    'question' => '有文法G[S]: <br/>
S→aAcB|Bd<br/>
A→AaB|c<br/>
B→bScA|b<br/>
句型aAaBcbbdcc的句柄是________。
',
                    'option' => [
                        'AaB','bd','c','b'
                    ],
                    'answer' => 'A'
                ]
            ]
        ],
        
        'blank'    =>[                      //填空题
            'name' => '填空题',
            'score'=>'2',
            'data' =>[
                1 => [
                    'question' => '一个上下文无关文法包含的4个组成部分分别是终结符、非终结符、开始符号、（           ）。',
                    'answer'   => '产生式'
                ], 2=> [
                    'question' => '在语法分析中，最常见的两种方法一定是自上而下分析法，另一是（      ）分析法。',
                    'answer' => '自下而上'
                ], 3=> [
                    'question' => '文法G所产生的句子的全体是文法G所定义的（            ）。',
                    'answer' => '语言'
                ], 4=> [
                    'question' => '若一个文法存在某个句子对应的两棵不同的语法树，则称这个文法（     ）二义性文法（是/不是）。',
                    'answer' => '是'
                ], 5=> [
                    'question' => 'Chomsky把文法分为（       ）种类型。(注意：请使用阿拉伯数字填空)',
                    'answer' => '4'
                ], 6=> [
                    'question' => '确定有限机DFA包含的五元分别是状态集，字母表，（        ），初态，终态集。',
                    'answer' => '单值映射'
                ], 7=> [
                    'question' => '词法分析阶段的任务是从左到右扫描源程序，从而逐个识别（        ）。',
                    'answer' => '单词'
                ], 8=> [
                    'question' => 'LL(1)文法一种有效方法是使用一张____________(也称为预测分析表)和一个栈进行联合控制的。',
                    'answer' => 'LL(1)分析表'
                ], 9=> [
                    'question' => 'LL（1）分析法的名字中第一“L”表示自顶向下分析是从左至右扫描输入串 ，第二个“L”表明（        ），“1”表明只需向右查看一个符号就可决定如何推导。',
                    'answer' => '分析过程中将用最左推导'
                ], 10=> [
                    'question' => '对编译程序而言，输入数据是（        ），输出结果是目标程序。',
                    'answer' => '源程序'
                ], 11=> [
                    'question' => '对于文法G[E]：  <br/>
					E→T|E+T  <br />
					T→F|T*F  <br />
					F→P^F|P  <br />
					P→(E)|i  <br />
					句型T+T*F+i的句柄是（        ）。',
                    'answer' => 'T'
                ], 12=> [
                    'question' => '设有文法G[S]: <br/>
S→a|b|(A)<br/>
A→SdA|S<br/>
句型(SdSdS)的最左素短语是________。
',
                    'answer' => 'SdS'
                ]

            ]
        ]
    ]
];

